* Devon98
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Devon98
Place Name                       | Devon Ice Cap
Geographic Location              | Canadian Arctic North
Ice Type                         | Ice cap
Data Reference                   | W. Colgan email
Data DOI                         | 
Science Reference                | Paterson, W., R. Koerner, D. Fisher et al. 1977. An oxygen-isotope climatic record from the Devon Island ice cap, Arctic Canada. Nature. 266: 508-511.
Science DOI                      | 10.1038/266508a0
Date                             | 2000-04-15
Longitude [°E]                   | -82.3
Latitude [°N]                    | 75.3
Location source                  | Colgan, 2021
Depth of top measurement [m]     | 13.0
Depth of bottom measurement [m]  | 218
Ice thickness [m]                | 301
Coverage [% of thickness]        | 68
Ice thickness source             | See data source
General_Note                     | 
Temperature_note                 | 
Thickness_note                   | 
Location_note                    | 
#+end_example

** Temperature

+ Provided in XLSX file via email.
  + Link to email: [[mu4e:msgid:AM0PR04MB61295B7BB1FF4BE1112B94ABA2F30@AM0PR04MB6129.eurprd04.prod.outlook.com][VS: Prince of Wales - ice temperature?]]
+ Note that temperature profile starts at casement, 1.55 m below Y2K surface, so all depths have +1.55 added to them.

#+BEGIN_example
From: William Colgan
To: Ken Mankoff
Subject: VS: Prince of Wales - ice temperature?
Date: Wed 02 Dec 2020 03:10:34 AM PST
Attachments: [1]Devon 1998 borehole Ts.xlsx(12.1K)

Ken – Devon98 temperature profile. Goes down to 217 m, bed at 299m.
Coordinates: N 75 deg 20.40, W 82 deg 08.40

Fra: Christian Zdanowicz
Sendt: 2. december 2020 11:39
Til: William Colgan
Emne: RE: Prince of Wales - ice temperature?

Re: Devon ice cap 1998

N 75 deg 20.40, W 82 deg 08.40
Alt: 1930 m asl

See Fig. 1 of attached paper for exact location.

David Fisher did the measurements using a thermistor string. [...] I
may have given you false hopes on this one, because the temperatures
on the deepest part of the borehole are sadly missing: David's notes
say the cable broke at 216 m depth ! The bottom of the hole was at 299
m. You could take a shot at extrapolating the gradient, of course,
maybe it agrees with the 72 and 73 boreholes.
#+END_example

** Thickness

+ Reported in email, also adjusted by 1.55 m.

** Location

+ Reported in email

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|      d |       t |
|  13.04 |  -22.46 |
|  23.04 |  -22.74 |
|  33.04 |  -22.76 |
|  38.04 |  -22.73 |
|  43.04 |   -22.7 |
|  48.04 |  -22.69 |
|  53.04 |  -22.64 |
|  58.04 |  -22.62 |
|  63.04 |  -22.58 |
|  68.04 |  -22.54 |
|  73.04 | -22.515 |
|  78.04 |  -22.47 |
|  83.04 | -22.415 |
|  88.04 |  -22.39 |
|  93.04 |  -22.34 |
|  98.04 |   -22.3 |
| 103.04 | -22.246 |
| 108.04 |  -22.19 |
| 113.04 |  -22.14 |
| 118.04 | -22.086 |
| 123.04 |  -22.03 |
| 128.04 |  -21.97 |
| 138.04 |  -21.85 |
| 148.04 |  -21.73 |
| 158.04 |  -21.61 |
| 168.04 |  -21.46 |
| 178.04 |  -21.32 |
| 188.04 |  -21.18 |
| 198.04 |  -21.03 |
| 208.04 |  -20.88 |
| 218.04 |  -20.73 |

